In [1]:
import pandas as pd

In [2]:
# Series = 1-dimensional

In [3]:
# 2 main datatypes
series = pd.Series(["BMW", "Toyota", "Honda"])

In [4]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [5]:
colors = pd.Series(["Red", "Blue", "White"])

In [6]:
colors

0      Red
1     Blue
2    White
dtype: object

In [7]:
# DataFrame = 2-dimensional

In [8]:
car_data = pd.DataFrame({"Car make": series, "Color": colors})
car_data

  Car make  Color
0      BMW    Red
1   Toyota   Blue
2    Honda  White

In [9]:
# Import data
car_sales = pd.read_csv("car-sales.csv")

In [10]:
car_sales

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [11]:
# Exporting a dataframe
car_sales.to_csv("exported-car-sales.csv", index=False)

In [12]:
exported_car_sales = pd.read_csv("exported-car-sales.csv")
exported_car_sales

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [13]:
# Import data from URL
heart_disease = pd.read_csv("https://raw.githubusercontent.com/jjuniorc/tensorflow/main/heart-disease.csv")
heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

## Describe Data

In [14]:
car_sales.dtypes

Make        object
Color       object
Odometer     int64
Doors        int64
Price        int64
dtype: object

In [15]:
car_sales.columns

Index(['Make', 'Color', 'Odometer', 'Doors', 'Price'], dtype='object')

In [16]:
car_columns = car_sales.columns
car_columns

Index(['Make', 'Color', 'Odometer', 'Doors', 'Price'], dtype='object')

In [17]:
car_sales.describe()

            Odometer      Doors         Price
count      10.000000  10.000000     10.000000
mean    78601.400000   4.000000   7645.000000
std     61983.471735   0.471405   5379.407753
min     11179.000000   3.000000   3500.000000
25%     35836.250000   4.000000   4625.000000
50%     57369.000000   4.000000   6625.000000
75%     96384.500000   4.000000   7375.000000
max    213095.000000   5.000000  22000.000000

In [19]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Make      10 non-null     object
 1   Color     10 non-null     object
 2   Odometer  10 non-null     int64
 3   Doors     10 non-null     int64
 4   Price     10 non-null     int64
dtypes: int64(3), object(2)
memory usage: 528.0+ bytes

In [21]:
car_sales.mean()

/var/folders/qp/b_2tkz9d7dn0md1mbqcqf_p00000gn/T/ipykernel_1379/4073448239.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  car_sales.mean()

Odometer    78601.4
Doors           4.0
Price        7645.0
dtype: float64

In [22]:
car_sales.sum()

Make        ToyotaHondaToyotaBMWNissanToyotaHondaHondaToyo...
Color           WhiteRedBlueBlackWhiteGreenBlueBlueWhiteWhite
Odometer                                               786014
Doors                                                      40
Price                                                   76450
dtype: object

In [23]:
car_sales["Doors"].sum()

40

In [24]:
len(car_sales)

10

## Viewing and selecting data

In [25]:
# Top 5 rows using head function without parameters
car_sales.head()

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500

In [26]:
# Top 7 rows using head function
car_sales.head(7)

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000
4  Nissan  White    213095      4   3500
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500

In [27]:
# Bottom 5 rows using tail function without parameters
car_sales.tail()

     Make  Color  Odometer  Doors  Price
5  Toyota  Green     99213      4   4500
6   Honda   Blue     45698      4   7500
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [28]:
# Bottom 3 rows using tail function
car_sales.tail(3)

     Make  Color  Odometer  Doors  Price
7   Honda   Blue     54738      4   7000
8  Toyota  White     60000      4   6250
9  Nissan  White     31600      4   9700

In [33]:
# Selection of rows by label or labeled-index with loc function
# Selection of rows by positional index with iloc function
animals = pd.Series(["cat", "dog", "bird", "panda", "snake"], index=[0, 3, 9, 8, 3])
# get animals with index 3
animals.loc[3]

3      dog
3    snake
dtype: object

In [34]:
# get animal with index 9
animals.loc[9]

'bird'

In [35]:
# getting car with index 3
car_sales.loc[3]

Make          BMW
Color       Black
Odometer    11179
Doors           5
Price       22000
Name: 3, dtype: object

In [38]:
# getting animal in index position 3 (zero-based index, so index 3 is the 4th position)
animals.iloc[3]

'panda'

In [39]:
# getting car in index position 3
car_sales.iloc[3]

Make          BMW
Color       Black
Odometer    11179
Doors           5
Price       22000
Name: 3, dtype: object

In [42]:
# Slice with iloc function

# get top 3 animals (up to 3rd position) in position list
animals.iloc[:3]

0     cat
3     dog
9    bird
dtype: object

In [44]:
# Slice with loc function
# get top 4 cars (up to index 3) in position list (same of head(4) function)
car_sales.loc[:3]

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
1   Honda    Red     87899      4   5000
2  Toyota   Blue     32549      3   7000
3     BMW  Black     11179      5  22000

In [45]:
# Select only Make column in the car_sales
car_sales["Make"]

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [46]:
# Another way to do the same as above selecting Make column
car_sales.Make

0    Toyota
1     Honda
2    Toyota
3       BMW
4    Nissan
5    Toyota
6     Honda
7     Honda
8    Toyota
9    Nissan
Name: Make, dtype: object

In [48]:
# Filter by condition
car_sales[car_sales["Make"] == "Toyota"]

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
2  Toyota   Blue     32549      3   7000
5  Toyota  Green     99213      4   4500
8  Toyota  White     60000      4   6250

In [49]:
# Filtering
car_sales[car_sales["Odometer"] > 100000]

     Make  Color  Odometer  Doors  Price
0  Toyota  White    150043      4   4000
4  Nissan  White    213095      4   3500